In [1]:
# Leave commented out unless you recieve and error that you do not have psycopg2 installed.

# import sys
# import subprocess

# try:
#    import psycopg2-
# except ImportError:
#     subprocess.check_call([sys.executable, "-m", "pip", "install", "--user", "psycopg2-binary"])
#     import psycopg2

# print(psycopg2.__version__)

In [2]:
import pandas as pd
from sqlalchemy import create_engine, text

In [3]:
database_name = 'prescribers'   

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [4]:
engine = create_engine(connection_string)

In [5]:

query = """

SELECT 
    * 
FROM 
    prescriber

"""

In [6]:
with engine.connect() as connection:
    result = connection.execute(text(query))
    prescriber = pd.DataFrame(result.fetchall(), columns=result.keys())

In [7]:
prescriber.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25050 entries, 0 to 25049
Data columns (total 17 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   npi                           25050 non-null  object
 1   nppes_provider_last_org_name  25049 non-null  object
 2   nppes_provider_first_name     25050 non-null  object
 3   nppes_provider_mi             19245 non-null  object
 4   nppes_credentials             23827 non-null  object
 5   nppes_provider_gender         25050 non-null  object
 6   nppes_entity_code             25050 non-null  object
 7   nppes_provider_street1        25050 non-null  object
 8   nppes_provider_street2        9790 non-null   object
 9   nppes_provider_city           25050 non-null  object
 10  nppes_provider_zip5           25050 non-null  object
 11  nppes_provider_zip4           21568 non-null  object
 12  nppes_provider_state          25050 non-null  object
 13  nppes_provider_country        25050 non-null  object
 14  specialty_description         25050 non-null  object
 15  description_flag              25050 non-null  object
 16  medicare_prvdr_enroll_status  25050 non-null  object
dtypes: object(17)
memory usage: 3.2+ MB

In [8]:
prescriber.head()

,npi,nppes_provider_last_org_name,nppes_provider_first_name,nppes_provider_mi,nppes_credentials,nppes_provider_gender,nppes_entity_code,nppes_provider_street1,nppes_provider_street2,nppes_provider_city,nppes_provider_zip5,nppes_provider_zip4,nppes_provider_state,nppes_provider_country,specialty_description,description_flag,medicare_prvdr_enroll_status
0,1003000282,BLAKEMORE,ROSIE,K,FNP,F,I,TENNESSEE PRISON FOR WOMEN,3881 STEWARTS LANE,NASHVILLE,37243,0001,TN,US,Nurse Practitioner,S,N
1,1003012022,CUDZILO,COREY,None,M.D.,M,I,2240 SUTHERLAND AVE,SUITE 103,KNOXVILLE,37919,2333,TN,US,Pulmonary Disease,S,E
2,1003013160,GRABENSTEIN,WILLIAM,P,M.D.,M,I,1822 MEMORIAL DR,None,CLARKSVILLE,37043,4605,TN,US,Family Practice,S,E
3,1003013947,OTTO,ROBERT,J,M.D.,M,I,2400 PATTERSON STREET SUITE 100,None,NASHVILLE,37203,2786,TN,US,Orthopedic Surgery,S,E
4,1003017963,TODD,JOSHUA,W,M.D.,M,I,1819 W CLINCH AVE,SUITE 108,KNOXVILLE,37916,2435,TN,US,Cardiology,S,E

In [9]:
# Bring SQL notebook in to Python


query1 = """

with ranked_zp as (
		select
			zip,
			tot_ratio,
			fipscounty,
			rank() over(partition by zip order by tot_ratio desc) as ranked
		from zip_fips
)
	SELECT
		
		rx.drug_name,
		fc.state,
		fc.county,
		sum (rx.total_claim_count) as total_count,
		p.population
	FROM prescriber AS pr
	JOIN prescription AS rx
	ON pr.npi = rx.npi
	JOIN ranked_zp AS rp
	ON rp.zip = pr.nppes_provider_zip5	
	JOIN population AS p
	ON p.fipscounty = rp.fipscounty
	JOIN fips_county AS fc
	ON fc.fipscounty = p.fipscounty
	JOIN drug AS d
	ON d.drug_name = rx.drug_name
	WHERE fc.state =  'TN' AND d.opioid_drug_flag = 'Y' and rp.ranked= 1
	group by fc.county, fc.state, rx.drug_name, p.population
 
"""
with engine.connect() as connection:
    result = connection.execute(text(query1))
    opioid_county = pd.DataFrame(result.fetchall(), columns=result.keys())

opioid_county

                           drug_name state    county total_count population
0              ACETAMINOPHEN-CODEINE    TN  ANDERSON         668      75538
1     BUTALB-CAFF-ACETAMINOPH-CODEIN    TN  ANDERSON          13      75538
2        BUTALBITAL COMPOUND-CODEINE    TN  ANDERSON          13      75538
3               BUTORPHANOL TARTRATE    TN  ANDERSON          12      75538
4                            BUTRANS    TN  ANDERSON          12      75538
...                              ...   ...       ...         ...        ...
1591                OXYCODONE HCL ER    TN    WILSON          19     128874
1592                       OXYCONTIN    TN    WILSON         827     128874
1593              OXYMORPHONE HCL ER    TN    WILSON         192     128874
1594                    TRAMADOL HCL    TN    WILSON        4039     128874
1595                 TRAMADOL HCL ER    TN    WILSON          73     128874

[1596 rows x 5 columns]

In [10]:
opioid_county['total_count'] = opioid_county['total_count'].astype(float)
opioid_county['population'] = opioid_county['population'].astype(float)
opioid_county.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1596 entries, 0 to 1595
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   drug_name    1596 non-null   object
 1   state        1596 non-null   object
 2   county       1596 non-null   object
 3   total_count  1596 non-null   float64
 4   population   1596 non-null   float64
dtypes: float64(2), object(3)
memory usage: 62.5+ KB

In [11]:
county_summary_df = ( 
    opioid_county 
    .groupby(['county', 'population'])['total_count'] 
    .sum() 
    .reset_index() 
)
county_summary_df

        county  population  total_count
0     ANDERSON     75538.0      34882.0
1      BEDFORD     46854.0       8289.0
2       BENTON     16154.0      10717.0
3      BLEDSOE     14413.0       3306.0
4       BLOUNT    127135.0      27352.0
..         ...         ...          ...
90       WAYNE     16713.0       6615.0
91     WEAKLEY     33776.0      14260.0
92       WHITE     26394.0       5439.0
93  WILLIAMSON    212161.0      41296.0
94      WILSON    128874.0      37417.0

[95 rows x 3 columns]

In [12]:
county_summary_df["claim_ratio"] = county_summary_df["total_count"] / county_summary_df["population"]
county_summary_df = county_summary_df.sort_values(by="claim_ratio", ascending=False)
county_summary_df.head(10)

        county  population  total_count  claim_ratio
75       SCOTT     21949.0      26118.0     1.189940
13        CLAY      7684.0       6483.0     0.843701
15      COFFEE     54074.0      43957.0     0.812905
89  WASHINGTON    126437.0     101935.0     0.806212
81    SULLIVAN    156519.0     117878.0     0.753123
24    FENTRESS     17940.0      12819.0     0.714548
31     HAMBLEN     63465.0      45241.0     0.712850
54     MADISON     97887.0      68021.0     0.694893
8      CARROLL     28137.0      19512.0     0.693464
39       HENRY     32263.0      21914.0     0.679230

In [13]:
county_summary_sorted = county_summary_df.sort_values(by = 'claim_ratio', ascending = False)
county_summary_sorted

        county  population  total_count  claim_ratio
75       SCOTT     21949.0      26118.0     1.189940
13        CLAY      7684.0       6483.0     0.843701
15      COFFEE     54074.0      43957.0     0.812905
89  WASHINGTON    126437.0     101935.0     0.806212
81    SULLIVAN    156519.0     117878.0     0.753123
..         ...         ...          ...          ...
60       MEIGS     11830.0       1275.0     0.107777
80     STEWART     13248.0       1403.0     0.105903
76  SEQUATCHIE     14654.0       1328.0     0.090624
43     JACKSON     11573.0       1042.0     0.090037
47        LAKE      7588.0        220.0     0.028993

[95 rows x 4 columns]

In [14]:
no_of_counties = 95
ten_percent = no_of_counties * 0.10
value = round(ten_percent)
value

10

In [15]:
top_10 = county_summary_sorted[:10]
top_10

        county  population  total_count  claim_ratio
75       SCOTT     21949.0      26118.0     1.189940
13        CLAY      7684.0       6483.0     0.843701
15      COFFEE     54074.0      43957.0     0.812905
89  WASHINGTON    126437.0     101935.0     0.806212
81    SULLIVAN    156519.0     117878.0     0.753123
24    FENTRESS     17940.0      12819.0     0.714548
31     HAMBLEN     63465.0      45241.0     0.712850
54     MADISON     97887.0      68021.0     0.694893
8      CARROLL     28137.0      19512.0     0.693464
39       HENRY     32263.0      21914.0     0.679230

In [16]:
top10_summary_df = top_10.reset_index(drop=True)
top10_summary_df.index = top10_summary_df.index+1
top10_summary_df

        county  population  total_count  claim_ratio
1        SCOTT     21949.0      26118.0     1.189940
2         CLAY      7684.0       6483.0     0.843701
3       COFFEE     54074.0      43957.0     0.812905
4   WASHINGTON    126437.0     101935.0     0.806212
5     SULLIVAN    156519.0     117878.0     0.753123
6     FENTRESS     17940.0      12819.0     0.714548
7      HAMBLEN     63465.0      45241.0     0.712850
8      MADISON     97887.0      68021.0     0.694893
9      CARROLL     28137.0      19512.0     0.693464
10       HENRY     32263.0      21914.0     0.679230